namespace UrbanLvivProjectAPI.Models.GeneralModels;

public enum ProblemType
{
    ROADS,                // Проблеми з дорогами (ями, тріщини, обірвані дроти)
    GARBAGE,              // Сміття на вулицях або переповнені сміттєві баки
    CRIME,                // Кримінальні ситуації (підозрілі особи, вандалізм)
    ELECTRICITY,          // Проблеми з електропостачанням (обірвані дроти, поломка світлофорів)
    WATER_SUPPLY,         // Проблеми з водопостачанням (поломка труб, відсутність води)
    SEWAGE,               // Проблеми з каналізацією (затоплення, неприємний запах)
    PARKS,                // Проблеми у парках (неприбрані території, зруйновані лавки)
    STREET_LIGHTING,      // Несправність вуличного освітлення
    NOISE,                // Шумове забруднення (будівельні роботи, голосна музика)
    TRAFFIC,              // Проблеми з дорожнім рухом (затори, погана організація)
    ENVIRONMENT,          // Екологічні проблеми (забруднення повітря, вирубка дерев)
    PUBLIC_TRANSPORT,     // Проблеми з громадським транспортом (затримки, переповнені автобуси)
    INFRASTRUCTURE,       // Проблеми з міською інфраструктурою (пошкоджені мости, тротуари)
    HEALTH,               // Проблеми зі здоров’ям та безпекою (недостатньо лікарень, медичні інциденти)
    ANIMAL_CONTROL,       // Проблеми з безпритульними тваринами
    FIRE_HAZARD,          // Потенційна пожежна небезпека
    OTHER,                 // Інші проблеми, які не підпадають під визначені категорії
    UNKNOWN
}